export default `# 一级标题
## 二级标题
### 三级标题
#### 四级标题
##### 五级标题
###### 六级标题

## 强调

**重点加粗**
*斜体*
~~删除线~~
***重点加粗斜体***

## 列表

- 无序列表
 - 嵌套无序列表
 - 嵌套无序列表
- 无序列表

+ 无序列表
+ 无序列表

* 无序列表
* 无序列表

1. 有序列表
2. 有序列表
3. 有序列表
  1. 嵌套有序列表
  2. 嵌套有序列表
  3. 嵌套有序列表

## 引用
  
> 引用内容引用内容引用内容引用内容引用内容引用内容引用内容引用内容引用内容
> 引用内容引用内容引用内容引用内容引用内容引用内容
>
>> 两层引用内容两层引用内容两层引用内容两层引用内容两层引用内容两层引用内容
 
## 代码

### 代码块

\`\`\`javascript
const num1 = 1;
const num2 = 2;
const add = (a, b) => a + b;
const num3 = add(num1 + num2);
\`\`\`

### 行内代码

这是\`行内代码\`

## 链接地址

[链接名称](https://mj921.github.io/my-tools "链接title")
<https://mj921.github.io/my-tools>

## 图片

![图片描述](https://mj921.github.io/my-tools/example.png "图片title")

## 表格

|表头1 左对齐|表头2 居中|表头3 右对齐|
|:-|:-:|-:|
|内容1|内容2|内容3|
|内容1|内容2|内容3|

## 分割线

***
---
___

## 复选框

- [ ] 1
- [x] 2`;
