<template>
  <div>
    <canvas ref="canvas" width="1000" height="800"></canvas>
  </div>
</template>
<script lang="ts" setup>
import { onMounted } from 'vue';
import { ref } from 'vue';

interface Point {
  x: number;
  y: number;
  around: { point: Point; distance: number }[];
  minDistance: number;
}

const canvas = ref<HTMLCanvasElement>();
const count = 100;
const offsetX = 20;
const offsetY = 20;

const points = ref<Point[]>([]);

for (let i = 0; i < count; i++) {
  points.value.push({
    x: Math.round(Math.random() * (1000 - offsetX * 2)),
    y: Math.round(Math.random() * (800 - offsetY * 2)),
    around: [],
    minDistance: Infinity,
  });
}
for (let i = 0; i < count; i++) {
  for (let j = 0; j < count; j++) {
    if (i !== j) {
      const dx = points.value[j].x - points.value[i].x;
      const dy = points.value[j].y - points.value[i].y;
      const distance = Math.round(Math.sqrt(dx * dx + dy * dy));
      points.value[i].around.push({
        point: points.value[j],
        distance,
      });
      if (distance <= points.value[i].minDistance) {
        points.value[i].minDistance = distance;
      }
    }
  }
  points.value[i].around.sort((a, b) => a.distance - b.distance);
}

const aaa: Record<string, { x: number; z: number }> = {
  纽伦堡: { x: 2215.414, z: 6717.67969 },
  慕尼黑: { x: 2558.996, z: 13949.8281 },
  因斯布鲁克: { x: 1749.96094, z: 18693.9531 },
  维罗纳: { x: -461.015625, z: 28983.2 },
  爱尔福特: { x: 1928.95313, z: -2153.871 },
  基尔: { x: -312.050781, z: -21220.8477 },
  威尼斯: { x: 4689.758, z: 29658.8047 },
  莱比锡: { x: 6649, z: -3503.957 },
  马格德堡: { x: 4026.879, z: -8242.57 },
  罗斯托克: { x: 5990.824, z: -19109.05 },
  萨尔茨堡: { x: 8575.719, z: 15994.3438 },
  柏林: { x: 9682.941, z: -10721.3594 },
  布拉格: { x: 13699.582, z: 3458.84766 },
  林茨: { x: 12715.5977, z: 13384.5039 },
  克拉根福: { x: 13091.1367, z: 22582.4375 },
  德累斯顿: { x: 12280.832, z: -1963.00781 },
  什切青: { x: 14502.5352, z: -15569.8906 },
  格拉茨: { x: 17816.3359, z: 20047.543 },
  布尔诺: { x: 21873.7148, z: 8794.824 },
  维也纳: { x: 20698.1953, z: 13595.41 },
  弗罗茨瓦夫: { x: 22802.7734, z: -3021.10547 },
  波兹南: { x: 22313.2773, z: -9682.324 },
  布拉迪斯拉发: { x: 24023.1719, z: 14410.8945 },
  卡塞尔: { x: -3381.44531, z: -4418.828 },
  汉诺威: { x: -2479.05469, z: -9636.527 },
  汉堡: { x: -1826.84375, z: -17158.3086 },
  法兰克福: { x: -6333.465, z: 2531.73438 },
  曼海姆: { x: -8322.992, z: 5545.828 },
  斯图加特: { x: -5607.965, z: 9426.875 },
  米兰: { x: -7916.57031, z: 28693.5625 },
  奥斯纳布吕克: { x: -8120.60547, z: -9933.598 },
  不来梅: { x: -4970.53125, z: -14856.2617 },
  斯特拉斯堡: { x: -11387.07, z: 10678.5469 },
  苏黎世: { x: -8773.934, z: 17498.34 },
  热那亚: { x: -9232.379, z: 34875.9766 },
  多特蒙德: { x: -8565.734, z: -5555.629 },
  伯尔尼: { x: -13180.9141, z: 19609.9766 },
  都灵: { x: -13222.375, z: 30211.8828 },
  科隆: { x: -13750.918, z: -3352.879 },
  杜伊斯堡: { x: -13663.7188, z: -6978.492 },
  杜塞尔多夫: { x: -13977.3047, z: -4719.72656 },
  格罗宁根: { x: -12787.7578, z: -15988.7813 },
  卢森堡: { x: -16384.34, z: 3937.84766 },
  梅斯: { x: -16594.625, z: 7093.59 },
  日内瓦: { x: -18549.2578, z: 23246.8945 },
  列日: { x: -17581.6484, z: -1501.37891 },
  阿姆斯特丹: { x: -19062.1328, z: -12231.3359 },
  第戎: { x: -22820.1523, z: 16285.375 },
  里昂: { x: -24469.918, z: 25272.1328 },
  布鲁塞尔: { x: -22026.1719, z: -3705.15625 },
  鹿特丹: { x: -20456.0781, z: -9455.93 },
  兰斯: { x: -24104.89, z: 5610.01563 },
  里尔: { x: -26796.0586, z: -2953.52734 },
  巴黎: { x: -31427.4727, z: 6366.074 },
  加莱: { x: -31163.1133, z: -5505.76563 },
  费利克斯托: { x: -31964.6836, z: -14857.3438 },
  多佛: { x: -33772.0742, z: -8554.48 },
  伦敦: { x: -40196.9922, z: -12259.34 },
  剑桥: { x: -37322.8125, z: -16539.5234 },
  格里姆斯比: { x: -36868.0234, z: -27345.3086 },
  新城堡: { x: -40128.168, z: -39307.8438 },
  阿伯丁: { x: -39596.793, z: -56040.47 },
  谢菲尔德: { x: -43088.88, z: -27107.6914 },
  南安普敦: { x: -46838.8672, z: -7893.371 },
  伯明翰: { x: -46451.25, z: -20943.125 },
  曼彻斯特: { x: -46298.7773, z: -28585.1445 },
  卡莱尔: { x: -46439.3, z: -40093.6 },
  爱丁堡: { x: -45400.8672, z: -47889.7969 },
  利物浦: { x: -49621.86, z: -29861.957 },
  格拉斯哥: { x: -51134.8242, z: -49241.7461 },
  加的夫: { x: -54555.4023, z: -15118.57 },
  斯旺西: { x: -57646.13, z: -17652.07 },
  普利茅斯: { x: -60566.5, z: -8502.445 },
  卡托维兹: { x: 30278.66, z: 1988.70313 },
  俄斯特拉发: { x: 27831.8125, z: 4715.97656 },
  佩奇: { x: 28439.8047, z: 25941.5234 },
  格但斯克: { x: 27642.9727, z: -21539.6641 },
  克拉科夫: { x: 33970.125, z: 2779.55078 },
  班斯卡_比斯特里察: { x: 32257.457, z: 10360.3516 },
  布达佩斯: { x: 31817.6953, z: 17362.5977 },
  利兹: { x: 31264.3281, z: -6664.043 },
  奥尔什丁: { x: 34258.4727, z: -18406.0664 },
  科希策: { x: 39343.793, z: 9974.258 },
  塞格德: { x: 36318.0938, z: 23928.0742 },
  华沙: { x: 36644.79, z: -10355.9609 },
  德布勒森: { x: 41291.4531, z: 16863.582 },
  卢布林: { x: 42744.07, z: -4625.086 },
  比亚韦斯托克: { x: 43598.27, z: -15603.52 },
  尼斯: { x: -15870.4922, z: 37786.04 },
  马赛: { x: -24222.5313, z: 38440.668 },
  圣奥尔本斯: { x: -26203.71, z: 28716.2188 },
  布尔: { x: -32141.9219, z: 16080.375 },
  克莱蒙特: { x: -31047.5742, z: 24228.3125 },
  蒙彼利埃: { x: -30502.4883, z: 35532.4922 },
  paluel核电站: { x: -33908.2422, z: -95.22266 },
  圣劳伦: { x: -35899.75, z: 13447.3164 },
  勒阿弗尔: { x: -39044.293, z: 845.3594 },
  勒芒: { x: -40249.8633, z: 9198.309 },
  西沃: { x: -39279.8477, z: 17996.84 },
  利摩日: { x: -37817.4023, z: 23211.8555 },
  图卢兹: { x: -39963.93, z: 34895.46 },
  戈尔弗克: { x: -40845.5156, z: 31102.43 },
  雷恩: { x: -47239.95, z: 7144.48438 },
  南特: { x: -47221.0742, z: 13091.9219 },
  拉罗谢尔: { x: -46580.87, z: 19507.4219 },
  波尔多: { x: -46188.6875, z: 27204.27 },
  罗斯科夫: { x: -53997.99, z: 2795.289 },
  布雷斯特: { x: -57421.54, z: 3199.17969 },
  博洛尼亚: { x: 219.988281, z: 33482.82 },
  佛罗伦萨: { x: 581.625, z: 38367.7734 },
  特尔尼: { x: 6216.492, z: 45691.66 },
  罗马: { x: 5511.125, z: 48579.21 },
  安科纳: { x: 9981.145, z: 39438.16 },
  巴勒莫: { x: 8350.891, z: 70487.19 },
  佩斯卡拉: { x: 12397.9961, z: 46327.97 },
  卡西诺: { x: 12043.8906, z: 52064.8945 },
  那不勒斯: { x: 12418.1016, z: 55071.93 },
  墨西拿: { x: 17975.7422, z: 70539.16 },
  别墅圣乔瓦尼: { x: 19020.7031, z: 70314.04 },
  卡塔尼亚: { x: 16420.7148, z: 74982.42 },
  卡坦扎罗: { x: 23291.6563, z: 66425.76 },
  巴里: { x: 23031.04, z: 53831.2734 },
  塔兰托: { x: 25490.4258, z: 57821.28 },
  苏扎拉: { x: -1130.94922, z: 31926.668 },
  帕尔马: { x: -3406.56641, z: 33434.168 },
  利沃诺: { x: -2968.42188, z: 39681.6836 },
  欧登塞: { x: 1017.5625, z: -27270.543 },
  奥尔堡: { x: 480.1328, z: -36290.2227 },
  希茨海尔斯: { x: 775.34375, z: -39243.4141 },
  弗雷德里克斯: { x: 2361.57031, z: -38511.5859 },
  盖瑟: { x: 5970.98047, z: -22420.4531 },
  哥德堡: { x: 6835.76172, z: -40547.6172 },
  奥斯陆: { x: 4140.789, z: -53680.668 },
  马尔默: { x: 10234.7344, z: -28001.293 },
  特雷勒堡: { x: 10508.1875, z: -26107.1563 },
  哥本哈根: { x: 6800.617, z: -28717.9063 },
  赫尔辛堡: { x: 9005.078, z: -30502.55 },
  延雪平: { x: 13877.1367, z: -40045.72 },
  卡尔斯克鲁纳: { x: 16745.4336, z: -31232.5234 },
  韦克舍: { x: 15519.2773, z: -35205.69 },
  林雪平: { x: 17511.5469, z: -43713.0273 },
  厄勒布鲁: { x: 16587.707, z: -48894.8438 },
  卡尔马: { x: 19959.36, z: -34554.6 },
  南泰利耶: { x: 23325.07, z: -46540 },
  韦斯特罗斯: { x: 20562.6016, z: -50738.4336 },
  斯德哥尔摩: { x: 24368.4766, z: -48316.2227 },
  尼奈斯港: { x: 24731.8555, z: -46499.9375 },
  乌普萨拉: { x: 23521.3281, z: -52104.625 },
  埃斯比_约: { x: -5274.55469, z: -27976.0156 },
  克里斯蒂安桑: { x: -4788.40234, z: -43061.625 },
  斯塔万格: { x: -10808.8164, z: -48421.8945 },
  卑尔根: { x: -10571.707, z: -56397.7656 },
};
const bbb: { x: number; z: number; name: string }[] = [];
Object.entries(aaa).forEach(([name, el]) => bbb.push({ ...el, name }));

onMounted(() => {
  const ctx = canvas.value?.getContext('2d');
  if (ctx) {
    const set = new Set();
    // for (let i = 0; i < count; i++) {
    //   const { x, y, around, minDistance } = points.value[i];
    //   ctx.beginPath();
    //   ctx.arc(x + offsetX, y + offsetY, 5, 0, Math.PI * 2);
    //   ctx.fillStyle = 'gray';
    //   ctx.fill();
    //   around.forEach(({ point: { x: x1, y: y1 }, distance }) => {
    //     if (!set.has(`${x}-${y}-${x1}-${y1}`) && !set.has(`${x1}-${y1}-${x}-${y}`)) {
    //       if (distance <= Math.max(100, points.value[i].around[0].distance)) {
    //         ctx.beginPath();
    //         ctx.moveTo(x + offsetX, y + offsetY);
    //         ctx.lineTo(x1 + offsetX, y1 + offsetY);
    //         ctx.strokeStyle = 'gray';
    //         ctx.stroke();
    //       }
    //       set.add(`${x}-${y}-${x1}-${y1}`);
    //     }
    //   });
    // }
    let minX = Infinity;
    let maxX = -Infinity;
    let minZ = Infinity;
    let maxZ = -Infinity;
    bbb.forEach(({ x, z }) => {
      if (x < minX) {
        minX = x;
      }
      if (x > maxX) {
        maxX = x;
      }
      if (z < minZ) {
        minZ = z;
      }
      if (z > maxZ) {
        maxZ = z;
      }
      ctx.beginPath();
      ctx.arc((80000 + x) / 200, (80000 + z) / 200, 5, 0, Math.PI * 2);
      ctx.fillStyle = 'gray';
      ctx.fill();
    });
  }
});
</script>
<style scoped lang="scss">
canvas {
  background-color: #000;
}
</style>
